#### LightDistributionStyle Enumeration

---

|  |
| --- |
| See Also |

Tags for specific light distribution styles

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum LightDistributionStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LightDistributionStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class LightDistributionStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Spherical | Spherical light distribution. |
| Hemispherical | Hemispherical light distribution. |
| Spot | Spot light distribution. |
| PhotometricWeb | Photometric web (IES) light distribution. |

# See Also

Autodesk.Revit.DB.Lighting Namespace